app/controllers/registries_controller.rb

  def index
    if params[:filter].present?
        filter = params[:filter]
        @registries = Registry.where("source LIKE ?", "%#{filter}%")
    else
        @registries = Registry.all
---
SELECT "registries".* FROM "registries"

  def set_registry
    @registry = Registry.find(params[:id])
---
SELECT "registries".* FROM "registries" WHERE "registries"."id" = 13 LIMIT 1